[net]
channels=3

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky


####### DarkNet19 Ends : Extra Layers for SSD#####
[extra]
[convolutional]
batch_normalize=1
size=3
stride=2
pad=0
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=0
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=2
pad=0
filters=256
activation=leaky

### YoloV2 Extra Layers for Reference Only. These are added in the Yolov2Head###
# [convolutional]
# batch_normalize=1
# size=3
# stride=1
# pad=1
# filters=1024
# activation=leaky
#
# [convolutional]
# batch_normalize=1
# size=3
# stride=1
# pad=1
# filters=1024
# activation=leaky
#
# [route]
# layers=-9
#
# [convolutional]
# batch_normalize=1
# size=1
# stride=1
# pad=1
# filters=64
# activation=leaky
#
# [reorg]
# stride=2
#
# [route]
# layers=-1,-4
#
# [convolutional]
# batch_normalize=1
# size=3
# stride=1
# pad=1
# filters=1024
# activation=leaky
#
# [convolutional]
# size=1
# stride=1
# pad=1
# filters=125
# activation=linear